arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	// A module busy finishing its own burst is not a failing module. Counting it
	// toward the cooldown / autofallback thresholds turns one overrun into a
	// 30 min blackout.
	if (m_error_is_module_busy) {
		m_error_is_module_busy = false;
		notify(KineisEventDeviceError({}));
		SMD_STATE_CHANGE(error, stopped);
		return;
	}

	m_error_count++;

	if (m_error_count >= SMD_MAX_CONSECUTIVE_ERRORS) {
		// Too many consecutive errors — enter 30 min cooldown to stop SPI spam
		// and save battery.  SMD will be retried after cooldown expires.
		m_cooldown_until = PMU::get_timestamp_ms() + SMD_ERROR_COOLDOWN_MS;
		DEBUG_ERROR("SmdSat: %u consecutive errors — cooldown for %u min", m_error_count,
		            SMD_ERROR_COOLDOWN_MS / 60000);
		VAL_SAT("cooldown_engaged reason=state_error duration_min=%u", SMD_ERROR_COOLDOWN_MS / 60000);
		m_error_count = 0;  // Reset for next attempt after cooldown
#if SMDSAT_AUTOFALLBACK_ENABLED
		// Autofallback: engage SAFE timings (or double the trust window if
		// we were already in SAFE and a FAST retest just failed).
		degraded_mode_engage();
#endif
	}

	notify(KineisEventDeviceError({}));
	SMD_STATE_CHANGE(error, stopped);
}

void SmdSat::state_error_exit() {}

/// @brief Defensive no-op: in normal flow this body never executes because
/// state_error_enter() always calls SMD_STATE_CHANGE(error, stopped) before
/// returning, so m_state is already 'stopped' by the time state_machine()
/// dispatches its next tick. Kept as a safety net: if state_error_enter()
/// is ever modified to return without transitioning (e.g. mid-refactor that
/// adds an async path), we still drop to 'stopped' here instead of looping
/// in error forever. The WARN log will surface the bug in field traces.
void SmdSat::state_error() {
	DEBUG_WARN("SmdSat::state_error: body reached — state_error_enter did not transit (regression?)");
	SMD_STATE_CHANGE(error, stopped);
}

#if SMDSAT_AUTOFALLBACK_ENABLED
/// @brief Load persisted SMD_DEGRADED_MODE flag on first SmdSat tick.
/// Reads ParamID::SMD_DEGRADED_MODE so a watchdog or power-cycle that
/// occurred while in SAFE mode keeps the SAFE timings on the next boot.
///
/// KNOWN LIMITATION (audit 2026-05 F1): only the SAFE/FAST flag is persisted —
/// m_safe_trust_window_hours always resets to 1 on boot. Consequence on a
/// sealed 1-year deployment: every WDT/POR reset while in SAFE mode triggers
/// a FAST retest 1 h post-boot regardless of where the doubling chain had
/// reached before (could have been 8 h, 16 h, 24 h). Cost ≈ 3 wasted TXes per
/// failed FAST retest. If reboots are rare (annual deployment, well-tested
/// firmware) the impact is bounded; if reboots become frequent the FAST/SAFE
/// chain effectively collapses to "always retest at 1 h", which is the
/// same behavior as a fresh device entering SAFE for the first time.
/// Fix path if needed: encode the window in SMD_DEGRADED_MODE itself
/// (0=FAST, N>0=SAFE/N-hours) and persist on every doubling.
///
/// KNOWN LIMITATION (audit 2026-05 F2): m_safe_mode_since_ms is reset to
/// PMU::get_timestamp_ms() at load time, i.e. boot timestamp — not the real
/// UTC moment when SAFE was engaged. degraded_mode_note_success() therefore
/// measures "hours in SAFE since this boot" rather than "hours since SAFE
/// was actually engaged". A boot that happens 23 h into SAFE waits a full
/// new trust window (24 h potentially) instead of retesting promptly.
/// Fix path if needed: persist RTC UTC timestamp at engage time, compare
/// against RTC on load.
void SmdSat::degraded_mode_load_if_needed() {
	if (m_degraded_mode_loaded) return;
	m_degraded_mode_loaded = true;
	unsigned int persisted = configuration_store->read_param<unsigned int>(ParamID::SMD_DEGRADED_MODE);
	if (persisted != 0) {
		g_smdsat_use_safe_timings = true;
		m_safe_mode_since_ms = PMU::get_timestamp_ms();
		m_safe_mode_tx_count = 0;
		DEBUG_INFO("SmdSat: degraded mode restored from flash — SAFE timings active");
		VAL_SAT("degraded_mode_load persisted=1 -> SAFE timings active");
	} else {
		VAL_SAT("degraded_mode_load persisted=0 -> FAST timings active");
	}
}

/// @brief Flip to SAFE timings on consecutive-error threshold.
/// First engagement: persist the flag so a reboot keeps us safe.
/// Re-entry while already in SAFE: a FAST retest just failed, so double the
/// trust window (cap 24h) before the next retest attempt.
void SmdSat::degraded_mode_engage() {
	if (!g_smdsat_use_safe_timings) {
		g_smdsat_use_safe_timings = true;
		m_safe_mode_since_ms = PMU::get_timestamp_ms();
		m_safe_mode_tx_count = 0;
		m_safe_trust_window_hours = 1;
		configuration_store->write_param(ParamID::SMD_DEGRADED_MODE, 1U);
		DEBUG_ERROR("SmdSat: degraded mode ENGAGED — SAFE timings, retest in %u h", m_safe_trust_window_hours);
		VAL_SAT("degraded_mode_engage trust_window_h=%u (first engage)", m_safe_trust_window_hours);
	} else {
		// We were already in SAFE and just hit the threshold again — the
		// previous FAST retest failed, double the window.
		if (m_safe_trust_window_hours < SAFE_TRUST_WINDOW_MAX_H) {
			m_safe_trust_window_hours = m_safe_trust_window_hours * 2;
			if (m_safe_trust_window_hours > SAFE_TRUST_WINDOW_MAX_H)
				m_safe_trust_window_hours = SAFE_TRUST_WINDOW_MAX_H;
		}
		m_safe_mode_since_ms = PMU::get_timestamp_ms();
		m_safe_mode_tx_count = 0;
		DEBUG_WARN("SmdSat: FAST retest failed — next retest in %u h", m_safe_trust_window_hours);
		VAL_SAT("degraded_mode_engage trust_window_h=%u (retest_failed)", m_safe_trust_window_hours);
	}
}

/// @brief Count successful TXes while in SAFE; retest FAST once the trust
/// window has elapsed AND enough TXes have succeeded.
void SmdSat::degraded_mode_note_success() {
	if (!g_smdsat_use_safe_timings) return;
	m_safe_mode_tx_count++;
	uint64_t hours_in_safe = (PMU::get_timestamp_ms() - m_safe_mode_since_ms) / (3600ULL * 1000ULL);
	if (m_safe_mode_tx_count >= SAFE_RETEST_MIN_TX && hours_in_safe >= m_safe_trust_window_hours) {
		g_smdsat_use_safe_timings = false;
		configuration_store->write_param(ParamID::SMD_DEGRADED_MODE, 0U);
		DEBUG_INFO("SmdSat: retesting FAST timings (was SAFE %lu h, %u successful TX)",
		           static_cast<unsigned long>(hours_in_safe), m_safe_mode_tx_count);
		VAL_SAT("retest_fast hours_in_safe=%lu tx_count=%u", static_cast<unsigned long>(hours_in_safe),
		        m_safe_mode_tx_count);
	}
}

