arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
/// @brief Cascade-failure detector: TX cancelled externally (dive event or
/// service_cancel) while state_transmitting had consumed a significant
/// fraction of its polling budget. Treats it as 1 consecutive error so the
/// autofallback can trip without waiting for the natural ~13-15s timeout —
/// matters because dive/surface flapping pre-empts that timeout in practice.
/// Idempotent: marks the snapshot consumed so a repeated stop_send/power_off
/// in the same TX cycle doesn't double-count.
void SmdSat::degraded_mode_note_tx_cancelled_during_cascade() {
	if (m_state != transmitting || m_initial_tx_state_counter == 0) return;
	unsigned int consumed = m_initial_tx_state_counter - m_state_counter;
	bool cascade =
	    (consumed * TX_CASCADE_FAILURE_DENOMINATOR) >= (m_initial_tx_state_counter * TX_CASCADE_FAILURE_NUMERATOR);
	m_initial_tx_state_counter = 0;  // Idempotent — consumed.
	if (!cascade) return;
	m_error_count++;
	DEBUG_WARN("SmdSat: TX cancelled after %u/%u failed polls — counting toward autofallback (m_error_count=%u/%u)",
	           consumed, consumed + m_state_counter, m_error_count, SMD_MAX_CONSECUTIVE_ERRORS);
	if (m_error_count >= SMD_MAX_CONSECUTIVE_ERRORS) {
		m_cooldown_until = PMU::get_timestamp_ms() + SMD_ERROR_COOLDOWN_MS;
		DEBUG_ERROR("SmdSat: %u consecutive cascade errors — cooldown for %u min", m_error_count,
		            SMD_ERROR_COOLDOWN_MS / 60000);
		m_error_count = 0;
		degraded_mode_engage();
	}
}
#endif  // SMDSAT_AUTOFALLBACK_ENABLED

void SmdSat::state_stopped_enter() {
	m_cmd.deinit();

	// Release wakeup pin LOW so SMD can enter deep sleep (STANDBY/SHUTDOWN)
	// before power is cut. This allows the STM32 to enter LPM immediately.
#ifdef SAT_EXTWAKEUP
	GPIOPins::clear(SAT_EXTWAKEUP);
#endif

	this->shutdown();
	GPIOPins::release_sensors_pwr();
	nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);

	// Stamp power-off timestamp so the next state_powering_on can skip the
	// redundant VDD discharge wait if the dive was long enough for natural
	// decay. Saves 50 ms (FAST) / 100 ms (SAFE) on the first Doppler at
	// surface for the sealed turtle case (dive duration minutes).
	m_last_power_off_ms = PMU::get_timestamp_ms();
	m_lpm_written_since_power_on = false;

	// Force entry to state_load_kmac on next boot for TCXO/LPM writes (RAM registers).
	// The explicit load_kmac_profil SPI command is only sent when RCONF changed
	// (m_needs_explicit_kmac_load) — otherwise STM32 auto-inits MAC from flash at POR.
	is_kmac_profil_loaded = false;
	m_kmac_pushed_this_session = false;

	m_packet_buffer.clear();

	notify(KineisEventPowerOff({}));
}

void SmdSat::state_stopped_exit() {}
void SmdSat::state_stopped() {}

void SmdSat::state_powering_on_enter() {}

void SmdSat::state_powering_on_exit() {
	m_next_delay = smdsat_spi_boot_delay_ms();
}

void SmdSat::state_powering_on() {
	TXTRACE("state_powering_on: starting power sequence (100ms discharge + %u ms VDD)", smdsat_delay_power_on_ms());
	LATMARK();

	// Cold start: the rail goes down, so the module loses .retentionRamData and
	// with it lpm_config. Everything the warm path is allowed to skip has to be
	// re-armed once here. A wake out of STANDBY never reaches this function --
	// power_on() rides the existing session -- which is exactly what makes
	// skipping the LPM write on that path correct.
	m_lpm_written_since_power_on = false;

	GPIOPins::acquire_sensors_pwr();

	// Step 0: Force a clean power cycle — kill any residual power from previous session.
	// After a nRF soft reset, SAT_PWR_EN may have been HIGH and the STM32WL
	// is still alive on VDD decoupling caps with a stale SPI sequence counter.
	// Without this, the first 2-phase write fails with INVALID_CMD.
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	GPIOPins::clear(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
	// Skip the redundant VDD discharge wait if the previous power-off already
	// allowed enough time for natural decay. The sealed turtle case (dive
	// duration minutes) always satisfies this, saving 50 ms (FAST) / 100 ms
	// (SAFE) on the FIRST Doppler at surface — the most latency-sensitive TX
	// of the burst. m_last_power_off_ms==0 means we've never powered off
	// (first cold boot), so keep the discharge to be safe.
	uint64_t now = PMU::get_timestamp_ms();
	bool vdd_already_decayed = (m_last_power_off_ms != 0) && ((now - m_last_power_off_ms) >= VDD_NATURAL_DISCHARGE_MS);
	if (!vdd_already_decayed) {
		nrf_delay_ms(smdsat_vdd_discharge_ms());  // VDD cap discharge — FAST=50ms / SAFE=100ms.
	} else {
		TXTRACE("state_powering_on: VDD discharge skipped (%llu ms since last off)", now - m_last_power_off_ms);
	}
	// power_off_immediate() in the surfacing-burst flow already drives VDD low;
	// 50ms is enough for the LinkIt V4 cap to discharge before the next POR.

	// Step 1: Assert RESET LOW before powering on — hold STM32WL in reset
	// during VDD ramp-up to prevent undefined behavior at low voltage.
	GPIOPins::clear(SAT_RESET);

	// Step 2: Assert wakeup pin HIGH (LinkIt only) before power-on
#ifdef SAT_EXTWAKEUP
	GPIOPins::init_pin(SAT_EXTWAKEUP);
	GPIOPins::set(SAT_EXTWAKEUP);
#endif

	// Step 3: Power ON — VPA stays LOW (PA regulator not needed until TX)
	GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
	DEBUG_TRACE("SmdSat::%s: SAT_PWR_EN=HIGH, RESET=LOW, VPA=LOW", __func__);

	// Step 4: Wait for VDD stabilization (150ms >> 5ms required)
	nrf_delay_ms(smdsat_delay_power_on_ms());

	// Step 5: Release RESET — pull-up on SMD VDD rail pulls HIGH → STM32WL boots
	GPIOPins::release_to_highz(SAT_RESET);
	DEBUG_TRACE("SmdSat::%s: RESET released, VPA held LOW until ping OK", __func__);

	TXTRACE("state_powering_on: RESET released, scheduling idle_pending in %u ms", smdsat_spi_boot_delay_ms());
	LATMARK();
	SMD_STATE_CHANGE(powering_on, idle_pending);
}

void SmdSat::state_load_kmac_enter() {
	m_state_counter = 20;  // MAC poll iterations before timeout
	                       // Do NOT set m_next_delay here — the first call writes RCONF/credentials
	                       // (steps 1-2) and must execute promptly after ping OK.  The 500ms delay
	                       // is only appropriate for MAC polling retries (step 3) and is set there.
}
void SmdSat::state_load_kmac_exit() {}

/// @brief Translate the host LPM bitmap into the module's.
///
/// The two enumerations do not agree, and nothing in the tree said so until a
/// bench session went looking for why LPM never worked.
///
///   host   (base_types.hpp, ParamID::SMD_LPM_MODE, and ARP60 over DTE)
///          0x01 NONE | 0x02 SLEEP | 0x04 STOP | 0x08 STANDBY | 0x10 SHUTDOWN
///   module (mgr_lpm.h in argos-smd-at-kineis-firmware)
///          0x00 NONE | 0x01 SLEEP | 0x02 STOP | 0x04 STANDBY | 0x08 SHUTDOWN
///
/// Ours is the module's shifted one bit left — it spends a bit naming NONE,
/// which the module encodes as the absence of every other bit. So a plain >> 1
/// maps the whole bitmap, NONE included.
///
/// Sending the host value raw is why the feature could never work.
/// bMGR_SPI_CMD_WRITELPM_cmd refuses any bit outside 0x0F, so host SHUTDOWN
/// (0x10) was rejected outright as a bad parameter, and host STANDBY (0x08)
/// arrived as the module's SHUTDOWN, which that firmware does not compile in and
/// also refuses. The only two values that arm the WKUP drop in
/// state_idle_enter() were exactly the two the module would not accept.
///
/// Measured on the bench 2026-09-01: ARP60=16 answers a WRITE 0x13 failure,
/// ARP60=4 (module STANDBY) is accepted silently.
static inline uint8_t smd_lpm_host_to_module(uint8_t host_bitmap) {
	return static_cast<uint8_t>(host_bitmap >> 1);
}

/// @brief Widen a single module mode into the CUMULATIVE mask the module expects.
///
/// The module's field is an "allowed" mask that CAPS what its own stack asks
/// for -- it is not a selector. MGR_LPM_enter() takes the mode the clients
/// request and walks DOWN until it finds one the mask allows:
///
///     deepest = eMGR_LPM_clientRequest();
///     while ((deepest & allowedLPMbitmap) == 0) {
///             deepest >>= 1;
///             if (deepest == 0) break;      // -> no low power at all
///     }
///
/// (argos-smd-at-kineis-firmware, Kineis/Lpm/Src/mgr_lpm.c). So sending the
/// single bit 0x04 means: enter STANDBY when the stack asks for STANDBY, and
/// stay FULLY ACTIVE whenever it asks for anything shallower -- the shift walks
/// past STOP and SLEEP, which the mask does not allow, down to zero. The
/// module's own compile-time defaults show the intended shape, cumulative:
///
///     LPM_STANDBY_ENABLED -> SLEEP | STOP | STANDBY
///
/// So widen to every mode up to and including the requested one.
static inline uint8_t smd_lpm_module_allowed_mask(uint8_t module_mode) {
	if (module_mode == 0) return 0;  // NONE -- caller does not write it
	return static_cast<uint8_t>((module_mode << 1) - 1);
}

void SmdSat::state_load_kmac() {
	TXTRACE("state_load_kmac: tick (pending_rconf=%u creds_written=%u explicit_kmac=%u poll=%u)",
	        !m_pending_rconf.empty(), m_credentials_written, m_needs_explicit_kmac_load, m_state_counter);

	// Sequence per firmware spec:
	// 1. Write RCONF/credentials if changed (flash operations — don't need MAC_OK)
	// 2. Load KMAC only if RCONF changed (otherwise STM32 auto-inits MAC from flash at POR)
	// 3. Poll READ_SPIMAC_STATE (0x27) until MAC_OK
	// 4. Write TCXO warmup + LPM (RAM registers, lost on every power cycle)

	// Step 1a: Apply deferred RCONF from switch_modulation() while stopped.
	if (!m_pending_rconf.empty()) {
		TXTRACE("state_load_kmac: applying deferred RCONF (set+save+wait ~120ms)");
		DEBUG_INFO("SmdSat::%s: applying deferred RCONF for modulation %d", __func__, static_cast<int>(m_modulation));
		auto wait_cmd = []() { nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2); };  // 60ms (v4.0.9 timing)
		std::string rconf_bin = Binascii::unhexlify(m_pending_rconf);
		smd_uint8_array_t rconf_struct = { static_cast<uint16_t>(rconf_bin.size()),
		                                   reinterpret_cast<uint8_t *>(rconf_bin.data()) };
		// F-SAT-3 audit fix: track whether BOTH set + save succeeded. If save
		// fails, the RAM RCONF on STM32 is half-written (next power cycle reverts
		// to flash) — but we MUST retry. Previously we unconditionally cleared
		// m_pending_rconf in the catch path AND in the success path, so a
		// transient SPI error during save_radio_conf would silently leave the
		// device on the wrong modulation for the rest of the deployment
		// (m_modulation in RAM does not match flash).
		bool save_succeeded = false;
		try {
			m_cmd.set_radio_conf(&rconf_struct);
			wait_cmd();
			m_cmd.save_radio_conf();
			wait_cmd();
			save_succeeded = true;
			m_credentials_written = true;
			m_needs_explicit_kmac_load = true;  // RCONF changed — must reload MAC
			DEBUG_INFO("SmdSat::%s: deferred RCONF applied OK", __func__);
			VAL_SAT("deferred_rconf_applied modulation=%d", (int)m_modulation);
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to apply deferred RCONF — retry on next session", __func__);
			VAL_SAT("deferred_rconf_throw modulation=%d (retry pending)", (int)m_modulation);
			// Also mark KMAC reload pending so next session re-fires the path
			m_needs_explicit_kmac_load = true;
		}
		if (save_succeeded) {
			m_pending_rconf.clear();
		}
		// else: keep m_pending_rconf so next state_load_kmac retries
	}

	// Step 1b: Write credentials if changed via DTE.
	if (!m_credentials_written) {
		m_credentials_written = true;
		if (configuration_store && configuration_store->is_credentials_dirty()) {
			TXTRACE("state_load_kmac: credentials dirty -> write_credentials_from_config (~480ms)");
			DEBUG_INFO("SmdSat::%s: credentials dirty, writing to SMD", __func__);
			if (!write_credentials_from_config()) {
				DEBUG_ERROR("SmdSat::%s: credential write failed", __func__);
				SMD_STATE_CHANGE(load_kmac, error);
				return;
			}
			configuration_store->clear_credentials_dirty();
			m_needs_explicit_kmac_load = true;  // Credentials changed — must reload MAC
		}
	}

