arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_idle_pending_exit() {
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
}

void SmdSat::state_idle_pending() {
	TXTRACE("state_idle_pending: tick entered, calling ping() now");
	// Capture t0 AFTER the log above so the LFS commit time isn't counted in ping_ms.
	[[maybe_unused]] uint64_t ping_t0 = PMU::get_timestamp_ms();
	bool ping_ok = m_cmd.ping();
	[[maybe_unused]] unsigned int ping_ms = static_cast<unsigned>(PMU::get_timestamp_ms() - ping_t0);
	TXTRACE("state_idle_pending: ping() returned %s after %u ms", ping_ok ? "OK" : "FAIL", ping_ms);
	if (ping_ok) {
		TXTRACE("state_idle_pending: ping OK (retries_left=%u) -> %s", m_state_counter,
		        is_kmac_profil_loaded ? "idle" : "load_kmac");
		// Small delay after ping ACK for STM32 DMA re-arm.
		// MAC readiness is verified in state_load_kmac (poll MAC_OK).
		nrf_delay_ms(10);
		// VPA stays LOW — only released just before TX (state_transmit_pending)
		if (!is_kmac_profil_loaded) {
			SMD_STATE_CHANGE(idle_pending, load_kmac);
		} else {
			SMD_STATE_CHANGE(idle_pending, idle);
		}
		return;
	}
	if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed to enter IDLE state", __func__);
		SMD_STATE_CHANGE(idle_pending, error);
	} else {
		TXTRACE("state_idle_pending: ping FAIL, retry in %u ms (counter=%u)", SMDSAT_DELAY_STATE_TICK_MS,
		        m_state_counter);
		m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	}
}


/// @brief Push the LPM mode to the module, right before it is left to sleep.
///
/// Deliberately NOT on the TX critical path. It is a RAM register that only
/// decides how the module idles, so it changes nothing for a transmission --
/// and if the host cuts the rail afterwards (the common case) it never mattered
/// at all. Measured on the bench 2026-09-02, surface-to-air without BLIND: the
/// TCXO and LPM writes together were 660 ms of an 840 ms driver path, each AT
/// command costing ~330 ms of module response time. Moving this one out is a
/// straight 40% cut with nothing given up.
void SmdSat::write_lpm_if_needed() {
	if (m_lpm_mode == 0x01) return;         // NONE -- nothing to arm
	if (m_lpm_written_since_power_on) return;  // still in the module's retained RAM

	uint8_t module_lpm = smd_lpm_module_allowed_mask(smd_lpm_host_to_module(m_lpm_mode));

	// SHUTDOWN is compiled OUT of the module firmware unless it is built with
	// LPM_SHUTDOWN_ENABLED; the write then fails. Say which mode is unreachable
	// and what to use instead, rather than leaving a bare error to decode later.
	// The cumulative mask means the module still has STANDBY to fall back on.
	if (m_lpm_mode & 0x10) {
		DEBUG_WARN("SmdSat::%s: LPM asks for SHUTDOWN — the module refuses it unless its firmware is built "
		           "with LPM_SHUTDOWN_ENABLED. STANDBY (ARP60=0x08) is the deepest mode this module can enter",
		           __func__);
	}

	try {
		m_cmd.write_lpm(&module_lpm);
		m_lpm_written_since_power_on = true;
		DEBUG_INFO("SmdSat::%s: LPM written — host 0x%02X -> module mask 0x%02X (deepest 0x%02X)", __func__,
		           m_lpm_mode, module_lpm, smd_lpm_host_to_module(m_lpm_mode));
	} catch (...) {
		DEBUG_WARN("SmdSat::%s: failed to write LPM mode (host 0x%02X -> module mask 0x%02X)", __func__,
		           m_lpm_mode, module_lpm);
	}
}

void SmdSat::state_idle_enter() {
	m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
	// Clamp ≥1: integer division of m_idle_timeout_ms / TICK_MS gives 0 when
	// idle_timeout < TICK_MS (10 ms). 0 then underflows on the first
	// --m_state_counter to UINT_MAX → idle effectively never times out, so
	// state_idle keeps re-scheduling until something external (packet arrival
	// or m_stopping) breaks the loop. Real callers pass 1 s default or
	// 35 s burst, so this is defense-in-depth against a future caller
	// passing a small or zero value.
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
	if (m_state_counter == 0) m_state_counter = 1;

	// If LPM allows STANDBY/SHUTDOWN, release wakeup pin LOW so SMD can
	// enter deep sleep while waiting for next TX in this session.
	//
	// IMPORTANT: in the normal send() path, m_packet_buffer is filled BEFORE
	// power_on() is called, so state_idle is transient (1 tick) — we go
	// straight to transmit_pending. Dropping WKUP here would let the STM32
	// start entering STANDBY, and raising it 10 ms later triggers a POR wake
	// (reset + firmware re-init ~100-200 ms) while we send SPI TX REQ
	// immediately → TX REQ fails. So only drop WKUP if the buffer is empty,
	// i.e. a real idle period (warm_up_for_tx-style pre-boot).
	// The module is about to be left alone: now is when its idle mode matters.
	write_lpm_if_needed();

#ifdef SAT_EXTWAKEUP
	m_wkup_lowered = false;
	if ((m_lpm_mode & 0x18) && !m_packet_buffer.length()) {
		GPIOPins::clear(SAT_EXTWAKEUP);
		m_wkup_lowered = true;
		DEBUG_TRACE("SmdSat::%s: WKUP LOW (LPM=0x%02X, idle lingering)", __func__, m_lpm_mode);
	}
#endif
}

void SmdSat::state_idle_exit() {
	// Only raise WKUP + wait if we actually lowered it in state_idle_enter.
	// Avoids a pointless 50 ms delay (and spurious wake-up POR) in the
	// common transient-idle case where WKUP was never dropped.
#ifdef SAT_EXTWAKEUP
	if (m_wkup_lowered) {
		GPIOPins::set(SAT_EXTWAKEUP);
		// Just enough for the wake edge to be seen. The real wait belongs to
		// idle_pending's ping-with-retries loop, which is bounded by the module
		// actually answering rather than by a guess.
		//
		// This used to be a blind 50 ms, with a comment blaming SHUTDOWN alone
		// for needing more. The module firmware says otherwise: STANDBY exit is
		// a cold reset too, so 50 ms was short for BOTH modes -- the module was
		// still booting when we spoke, and its RAM registers were gone either
		// way. state_idle() now routes back through idle_pending, which waits
		// properly and re-runs the boot configuration.
		nrf_delay_ms(10);
		m_wkup_lowered = false;
		DEBUG_TRACE("SmdSat::%s: WKUP HIGH (wakeup from LPM)", __func__);
	}
#endif
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
}

void SmdSat::state_idle() {
	if (m_packet_buffer.length()) {
		// If we actually let the module sleep, it did not merely idle: STANDBY
		// exit is a COLD RESET of the STM32. Its own firmware says so --
		// LPM_standby_enter() runs GPIO_DisableAllToAnalogInput(), tearing the
		// SPI pins down with everything else, and notes "STDBY exit leads to
		// reset of the uC, all peripherals will be restarted through normal
		// wake-up sequence". So on the way back there is no SPI slave for
		// ~100-200 ms, and the TCXO / KMAC context we wrote is gone.
		//
		// Going straight to transmit_pending therefore talked to a module that
		// was still booting: every command read back the master's own marker
		// (AA AA ...), the ping failed, and the session ended in
		// "failed to enter IDLE state". Measured on the bench 2026-09-01.
		//
		// idle_pending is exactly the path that handles this, and it already
		// exists: it re-inits our SPI, pings with 10 retries, and routes to
		// load_kmac when the profile is not loaded. Clear the flag and use it.
		if (m_wkup_lowered) {
			DEBUG_INFO("SmdSat::%s: module was in LPM — cold boot on wake, re-running boot config", __func__);
			is_kmac_profil_loaded = false;
			m_kmac_pushed_this_session = false;
			SMD_STATE_CHANGE(idle, idle_pending);
			return;
		}
		TXTRACE("state_idle: packet pending -> transmit_pending");
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		SMD_STATE_CHANGE(idle, transmit_pending);
	} else if (m_stopping) {
		SMD_STATE_CHANGE(idle, stopped);
	} else {
		m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		if (--m_state_counter == 0) {
			DEBUG_TRACE("SmdSat::%s: idle timeout elapsed", __func__);
			SMD_STATE_CHANGE(idle, stopped);
		}
		return;
	}

	// Mirror the clamp from state_idle_enter — same UINT_MAX underflow risk
	// when transitioning back to idle from a TX with a small idle_timeout.
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
	if (m_state_counter == 0) m_state_counter = 1;
}

