arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_transmit_pending_enter() {
	m_state_counter = 3;
}

void SmdSat::state_transmit_pending_exit() {
	// First TX after power-on: warmup forced to 0 ONLY if the die is warm enough.
	// Cold die (deep cold dive then quick surface) keeps the configured warmup
	// to avoid an off-frequency first TX. Must match the gate logic in
	// state_load_kmac so the SMD's actual warmup matches our poll horizon.
	bool tcxo_skip = m_is_first_tx && (PMU::get_die_temperature_c() >= TCXO_SKIP_TEMP_THRESHOLD_C);
	unsigned int effective_warmup = tcxo_skip ? 0 : m_tcxo_warmup_time;
	unsigned int base_delay = (effective_warmup > 0) ? SMDSAT_DELAY_CMD_TX : smdsat_first_tx_base_delay_ms();
	m_next_delay = base_delay + (effective_warmup * 1000);
	TXTRACE("state_transmit_pending_exit: scheduling 1st TX poll in %u ms (first_tx=%u warmup=%u s)", m_next_delay,
	        m_is_first_tx, effective_warmup);
}

// Keep every retransmission of one logical message on the same Argos MAC message
// counter (MC). The SMD auto-increments MC after each TX, so without this each
// repeat of the same payload would carry a different MC. Policy (ALL modes —
// LEGACY / pass-prediction / duty-cycle / doppler / surface-doppler — because
// this is the single choke point for every SMD TX):
//   - NEW message (payload differs from the previous TX): do NOT touch the MC.
//     No SPI op is issued, so the first-TX timing is preserved (critical for
//     surface-doppler). The message goes out with the SMD's natural MC.
//   - REPEAT (identical payload): decrement MC by 1 (mod 512) so this copy is
//     transmitted with the same counter as the previous identical copy. Every
//     repeat lands back on that first MC.
// Optional / graceful: if the module firmware lacks the MC command, the read or
// write returns false, we latch "unsupported" and leave the SMD to auto-manage
// its MC — nothing else changes.
void SmdSat::apply_message_counter_hold() {
	if (m_mc_support == McSupport::NO) return;  // module lacks the MC command — leave the SMD's MC auto-managed

	// BLIND owns its own repetitions, so the host must keep its hands off the
	// counter. We hand the module ONE payload and it emits retx_nb + 1 copies on
	// its own schedule, numbering them itself; every AT+TX the host issues in
	// BLIND is therefore a genuinely NEW message. Decrementing here would either
	// do nothing (the module renumbers anyway) or collide with its numbering.
	// The hold exists for the opposite case: without BLIND the host itself sends
	// the same payload once per NTRY round, each one a separate transmission the
	// module would number afresh -- that is where repeats must be pinned to one
	// MC.
	unsigned int blind_rn = 0, blind_period = 0;
	if (smd_blind_active(blind_rn, blind_period)) return;

	const bool is_repeat = !m_mc_last_payload.empty() && (m_tx_buffer == m_mc_last_payload);

	if (!is_repeat) {
		// New message — leave the MC untouched (no SPI op → first-TX timing
		// preserved). Just remember the payload to detect future repeats.
		m_mc_last_payload = m_tx_buffer;
		return;
	}

	// Repeat of the same message — decrement the MC by 1 (mod 512) so this copy
	// reuses the counter of the previous identical transmission.
	uint16_t cur = 0;
	if (!m_cmd.read_message_counter(&cur)) {
		DEBUG_INFO("SmdSat::%s: read MC unsupported — MC hold disabled (SMD auto-manages MC)", __func__);
		m_mc_support = McSupport::NO;
		return;
	}
	uint16_t dec = (cur == 0) ? 511 : static_cast<uint16_t>(cur - 1);
	if (m_cmd.set_message_counter(dec)) {
		m_mc_support = McSupport::YES;
		DEBUG_TRACE("SmdSat::%s: repeat — MC %u -> %u (held)", __func__, cur, dec);
	} else {
		DEBUG_INFO("SmdSat::%s: set MC unsupported — MC hold disabled", __func__);
		m_mc_support = McSupport::NO;
	}
}

void SmdSat::state_transmit_pending() {
	if (m_tx_buffer.size()) {
		TXTRACE("state_transmit_pending: calling initiate_tx (%u bytes)", static_cast<unsigned>(m_tx_buffer.size()));
		LATMARK();
		// Release VPA just before TX — PA regulator needs to be enabled for RF output
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
		DEBUG_TRACE("SmdSat::%s: VPA released for TX", __func__);
#endif
		bool tx_started = false;
		try {
			// Keep every repeat of the same message on one Argos MC (RSPB).
			apply_message_counter_hold();
			tx_started = m_cmd.initiate_tx(m_tx_buffer);
		} catch (...) {
			// Both calls reach send_command_aplus, which throws
			// ErrorCode::SPI_COMMS_ERROR on a transient SPIM fault: initiate_tx
			// directly, apply_message_counter_hold via read/set_message_counter
			// (send_command_auto / send_command_2phase both funnel into aplus).
			// Absorb it here, like every other SPI call in this driver, so it
			// routes to the SMD error state + cooldown + autofallback
			// accounting. Letting it unwind instead reaches a global ErrorEvent
			// that bypasses SMD recovery entirely and leaves m_tx_buffer stale.
			//
			// Aborting the TX when only the MC hold threw is deliberate: a throw
			// there means the SPI link is already faulting, so initiate_tx would
			// almost certainly follow, and the error state is what drives
			// recovery.
			DEBUG_ERROR("SmdSat::%s: TX setup threw (SPI) — aborting TX", __func__);
			tx_started = false;
		}
		if (!tx_started) {
			DEBUG_ERROR("SmdSat::%s: initiate_tx failed, aborting TX", __func__);
			m_tx_buffer.clear();
			SMD_STATE_CHANGE(transmit_pending, error);
			return;
		}
		TXTRACE("state_transmit_pending: initiate_tx OK, TX started on STM32");
#ifdef BENCH_TEST
		// One marker, not the twelve TXTRACE lines: each of those is a DEBUG_INFO
		// committed to LFS, which inflates the very latency being measured. This
		// single line is what a surface-to-air stopwatch keys on; the marks are
		// the breakdown, recorded in RAM along the way and printed only here.
		LATMARK();
		{
			char lb[128];
			int o = snprintf(lb, sizeof(lb), "SmdSat: TXSTART ms=");
			for (uint8_t i = 0; i < m_lat_n && o > 0 && o < (int)sizeof(lb); i++)
				o += snprintf(lb + o, sizeof(lb) - o, "%u%s", (unsigned)m_lat[i],
				              (i + 1 < m_lat_n) ? "," : "");
			DEBUG_ERROR("%s uptime=%llu (power_on,pwrseq,reset,idle_pending,mac,initiate,txstart)", lb,
			           (unsigned long long)PMU::get_timestamp_ms());
			m_lat_n = 0;
		}
#endif
		notify(KineisEventTxStarted({}));
		SMD_STATE_CHANGE(transmit_pending, transmitting);
	} else if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed accept SEND command", __func__);
		SMD_STATE_CHANGE(transmit_pending, error);
	} else {
		m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	}
}

void SmdSat::state_transmitting_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint32_t total_timeout_ms = (m_tcxo_warmup_time * 1000) + 5000;
	// BLIND: the module transmits retx_nb copies retx_period_s apart before it
	// reports +TX — extend the poll window to cover the whole burst.
	unsigned int rn = 0, period = 0;
	if (smd_blind_active(rn, period)) {
		// One period MORE than rn * period. retx_nb's exact meaning -- total
		// transmissions, or retransmissions on top of the first -- is not
		// documented anywhere we can read: the struct is handed to the closed
		// Kineis stack (KNS_MAC_BLIND_usrCfg_t, kns_mac_prfl_cfg.h) and the
		// header says nothing. Measured both readings on the same board and the
		// same retx_nb=3/period=60s config: bursts completing at ~120-126 s (3
		// transmissions) and bursts still running past 190 s (4). With the old
		// rn * period the window was 180 s + warmup + 5 s = 190 s, so the second
		// case lost by seconds -- the module was still emitting, the host gave
		// up, and the next session found the MAC at MAC_TX_IN_PROGRESS. One
		// extra period is the smallest margin that covers both readings; the 2 h
		// cap below still bounds an extreme config.
		uint64_t burst_ms = ((uint64_t)rn + 1ULL) * (uint64_t)period * 1000ULL;
		if (burst_ms > 7200000ULL) burst_ms = 7200000ULL;
		total_timeout_ms += (uint32_t)burst_ms;
		DEBUG_INFO("SmdSat::%s: BLIND — TX poll window +%u ms (burst)", __func__, (uint32_t)burst_ms);
	}
	m_state_counter = (total_timeout_ms / smdsat_timing_tx_poll_ms()) + 1;
#if SMDSAT_AUTOFALLBACK_ENABLED
	// Snapshot for cascade-failure detection in stop_send / power_off_immediate.
	m_initial_tx_state_counter = m_state_counter;
#endif
	DEBUG_TRACE("SmdSat::%s: poll timeout=%ums | counter=%u", __func__, total_timeout_ms, m_state_counter);
}

void SmdSat::state_transmitting_exit() {
	// First TX done: restore configured TCXO warmup on STM32 for subsequent TX
	// in THIS session (RAM register, lost on power cycle). This does NOT touch the
	// fast first-TX path (state_load_kmac forces warmup=0 when the TCXO is already
	// warm) — it only makes sure every *subsequent* in-session TX gets the real
	// warmup, so the carrier doesn't drift off-frequency and lose the Argos pass.
	//
	// The STM32WL is not ready for a fresh SPI command in the few ms right after
	// MAC_TX_DONE: the field log showed REQ 0x29 → "IDLE pattern, no response
	// ready" on all 3 instant auto-retries, leaving the warmup stuck at 0 for the
	// rest of the burst. Give it a settle window and a few spaced attempts so the
	// restore actually lands.
	if (m_is_first_tx && m_tcxo_warmup_time > 0) {
		static constexpr uint8_t TCXO_RESTORE_ATTEMPTS = 3;
		static constexpr uint32_t TCXO_RESTORE_SETTLE_MS = 50;  // STM32WL post-TX settle
		bool restored = false;
		for (uint8_t attempt = 0; attempt < TCXO_RESTORE_ATTEMPTS && !restored; attempt++) {
			nrf_delay_ms(TCXO_RESTORE_SETTLE_MS);
			try {
				m_cmd.write_tcxo_warmup(m_tcxo_warmup_time * 1000);
				DEBUG_TRACE("SmdSat::%s: restored TCXO warmup: %u s (attempt %u)", __func__, m_tcxo_warmup_time,
				            attempt + 1);
				restored = true;
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: TCXO warmup restore attempt %u/%u failed", __func__, attempt + 1,
				           TCXO_RESTORE_ATTEMPTS);
			}
		}
	}
	// Clear unconditionally: the first TX of every session is re-armed by
	// state_starting() (m_is_first_tx=true on each power_on), so this never
	// affects the fast first-TX path — it only governs in-session subsequent TX.
	m_is_first_tx = false;
	// Drive VPA LOW after TX — PA regulator no longer needed
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
	DEBUG_TRACE("SmdSat::%s: VPA driven LOW after TX", __func__);
#endif
}

