arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_transmitting() {
	if (m_cmd.is_tx_finished()) {
		if (m_tx_buffer.size()) {
			TXTRACE("state_transmitting: TX FINISHED — total elapsed");
			m_tx_buffer.clear();
			// is_tx_finished() returns true for MAC_TX_DONE (real success),
			// MAC_TX_TIMEOUT (no satellite reception), AND MAC_ERROR (hard
			// failure). Only MAC_TX_DONE should fire KineisEventTxComplete —
			// otherwise AFTER_LAST_TX cooldown arms on a failed TX and locks
			// out the whole surface cycle even though no packet was sent.
			bool tx_success = m_cmd.is_tx_successful();
			if (!tx_success) {
				TXTRACE("state_transmitting: TX FAILED (timeout/error) — notifying DeviceError");
				notify(KineisEventDeviceError({}));
				SMD_STATE_CHANGE(transmitting, stopped);
				return;
			}
			m_error_count = 0;  // TX success — reset consecutive error counter
#if SMDSAT_AUTOFALLBACK_ENABLED
			// Autofallback: track successful TXes while in SAFE so the
			// trust window can close and we retest FAST.
			degraded_mode_note_success();
#endif
			DEBUG_TRACE("SmdSat::%s: notify KineisEventTxComplete", __func__);
			notify(KineisEventTxComplete({}));
		}
		SMD_STATE_CHANGE(transmitting, stopped);
	} else {
		if (!m_tx_buffer.size()) {
			SMD_STATE_CHANGE(transmitting, stopped);
		} else if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: TX timeout after polling", __func__);
			SMD_STATE_CHANGE(transmitting, error);
		} else {
			TXTRACE("state_transmitting: not finished, poll again in %u ms (left=%u)", smdsat_timing_tx_poll_ms(),
			        m_state_counter);
			m_next_delay = smdsat_timing_tx_poll_ms();
		}
	}
}

// ============================================================================
// KineisDevice interface
// ============================================================================

void SmdSat::stop_send() {
	DEBUG_TRACE("SmdSat::%s", __func__);
#if SMDSAT_AUTOFALLBACK_ENABLED
	// Soft-cancel path (service_cancel timeout / similar) — apply the same
	// cascade detector as power_off_immediate so cancellations during an
	// ongoing SPI poll cascade still count toward the autofallback.
	degraded_mode_note_tx_cancelled_during_cascade();
#endif
	m_packet_buffer.clear();
	m_tx_buffer.clear();
}

void SmdSat::start_receive(const KineisModulation mode) {
	(void)mode;
	DEBUG_TRACE("SmdSat::%s: Not supported", __func__);
}

bool SmdSat::stop_receive() {
	DEBUG_TRACE("SmdSat::%s: Not supported", __func__);
	return false;
}

void SmdSat::set_frequency(double freq_mhz) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	m_tx_freq = freq_mhz;
}

unsigned int SmdSat::cooldown_remaining_ms() const {
	if (m_cooldown_until == 0) return 0;
	uint64_t now = PMU::get_timestamp_ms();
	return (now < m_cooldown_until) ? static_cast<unsigned int>(m_cooldown_until - now) : 0;
}

void SmdSat::send(const KineisModulation mode, const KineisPacket &user_payload, const unsigned int payload_length) {
	m_tx_trace_start_ms = PMU::get_timestamp_ms();
	TXTRACE("send() entered: mode=%d state=%d first_tx=%u tcxo_warmup=%u s", static_cast<int>(mode),
	        static_cast<int>(m_state), m_is_first_tx, m_tcxo_warmup_time);

#if SMDSAT_AUTOFALLBACK_ENABLED
	// Lazy sync of runtime flag from persisted param. Lets a DTE PARMW SMP00=0
	// (operator-triggered manual clear after a confirmed root-cause fix) take
	// effect at the next TX without requiring a reboot. The runtime flag
	// `g_smdsat_use_safe_timings` is otherwise only set at boot via
	// `degraded_mode_load_if_needed()` and by `degraded_mode_engage()`. The
	// reverse direction (param=1 while flag=false) cannot happen because DTE
	// PARMW rejects SMP00=1 (see dte_handler.cpp::PARMW_REQ); only
	// degraded_mode_engage() can set param=1, and it also sets the flag.
	if (g_smdsat_use_safe_timings && configuration_store
	    && configuration_store->read_param<unsigned int>(ParamID::SMD_DEGRADED_MODE) == 0) {
		DEBUG_INFO("SmdSat::send: DTE-cleared degraded mode — re-engaging FAST timings");
		VAL_SAT("degraded_mode_cleared_via_dte -> FAST timings");
		g_smdsat_use_safe_timings = false;
		m_safe_mode_tx_count = 0;
		m_safe_trust_window_hours = 1;
		m_safe_mode_since_ms = 0;
	}
#endif

	// Reject operations during error cooldown — prevents SPI spam when SMD is unresponsive
	if (m_cooldown_until > 0 && PMU::get_timestamp_ms() < m_cooldown_until) {
		unsigned int remaining_ms = static_cast<unsigned int>(m_cooldown_until - PMU::get_timestamp_ms());
		DEBUG_WARN("SmdSat::%s: in cooldown (%u min remaining) — TX rejected", __func__, remaining_ms / 60000);
		VAL_SAT("send_rejected_cooldown remaining_ms=%u", remaining_ms);
		notify(KineisEventDeviceError({}));
		return;
	}
	if (m_cooldown_until > 0) {
		VAL_SAT("cooldown_expired_naturally");
	}
	m_cooldown_until = 0;  // Cooldown expired — allow operation

	DEBUG_TRACE("SmdSat::%s: length %u mode=%d current=%d", __func__, payload_length, static_cast<int>(mode),
	            static_cast<int>(m_modulation));
	SmdArgosModulation requested = kineis_to_smd_mod(mode);
	if (requested != m_modulation) {
		DEBUG_WARN("SmdSat::%s: TX mode %d != current modulation %d — call switch_modulation() first", __func__,
		           static_cast<int>(requested), static_cast<int>(m_modulation));
	}

	unsigned int max_payload_size = 0;
	switch (m_modulation) {
	case ARGOS_MOD_LDA2: max_payload_size = ARGOS_TX_LDA2_PAYLOAD_BYTE_SIZE; break;
	case ARGOS_MOD_LDK: max_payload_size = ARGOS_TX_LDK_PAYLOAD_BYTE_SIZE; break;
	case ARGOS_MOD_VLDA4: max_payload_size = ARGOS_TX_VLDA4_PAYLOAD_BYTE_SIZE; break;
	default: DEBUG_TRACE("SmdSat::%s: Unknown modulation type %d", __func__, m_modulation); return;
	}

	unsigned int effective_payload_length = std::min(payload_length, static_cast<unsigned int>(user_payload.size()));
	if (effective_payload_length > max_payload_size) {
		DEBUG_ERROR("SmdSat::%s: Payload truncated from %u to %u bytes", __func__, effective_payload_length,
		            max_payload_size);
		effective_payload_length = max_payload_size;
	}

	unsigned int padded_size = max_payload_size;
	if (m_modulation == ARGOS_MOD_LDA2) {
		padded_size = ((effective_payload_length + ARGOS_TX_LDA2_SIZE_STEP - 1) / ARGOS_TX_LDA2_SIZE_STEP)
		              * ARGOS_TX_LDA2_SIZE_STEP;
		if (padded_size < ARGOS_TX_LDA2_MIN_BYTE_SIZE) padded_size = ARGOS_TX_LDA2_MIN_BYTE_SIZE;
		if (padded_size > max_payload_size) padded_size = max_payload_size;
		DEBUG_TRACE("SmdSat::%s: LDA2 padded %u -> %u bytes", __func__, effective_payload_length, padded_size);
	}

	m_packet_buffer.assign(padded_size, 0);
	std::copy(user_payload.begin(), user_payload.begin() + effective_payload_length, m_packet_buffer.begin());

	DEBUG_TRACE("SmdSat::%s: raw data[%u]=%s", __func__, effective_payload_length,
	            Binascii::hexlify(m_packet_buffer).c_str());

	DEBUG_TRACE("SmdSat::%s::Packet size %u", __func__, static_cast<unsigned int>(m_packet_buffer.size()));

	TXTRACE("send() calling power_on() (payload built, %u bytes)", static_cast<unsigned>(m_packet_buffer.size()));

	power_on();
}

void SmdSat::set_tcxo_warmup_time(unsigned int time_s) {
	m_tcxo_warmup_time = time_s;
}

