arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::set_lpm_mode(uint8_t lpm_bitmap) {
#ifdef BENCH_FORCE_LPM_NONE
	// Bench diagnostic: force LPM=NONE (0x01) so the SMD never enters SLEEP/STOP.
	// Isolates whether an SPI failure is the module failing to wake from a
	// low-power mode (e.g. config SMD_LPM_MODE=4=STOP with an SMD firmware built
	// without LPM) vs a genuine SPI hardware/protocol problem.
	DEBUG_WARN("SmdSat::set_lpm_mode: BENCH_FORCE_LPM_NONE — forcing NONE (was 0x%02X)", lpm_bitmap);
	m_lpm_mode = 0x01;
	return;
#endif
	// Sanitize: STANDBY(0x08) and SHUTDOWN(0x10) require SAT_EXTWAKEUP pin
#ifndef SAT_EXTWAKEUP
	if (lpm_bitmap & 0x18) {
		DEBUG_WARN("SmdSat::%s: STANDBY/SHUTDOWN disabled (no SAT_WKUP pin), masking to 0x%02X", __func__,
		           lpm_bitmap & 0x07);
		lpm_bitmap &= 0x07;  // Keep only NONE|SLEEP|STOP
	}
#endif
	if (lpm_bitmap == 0) lpm_bitmap = 0x01;  // Fallback to NONE
	m_lpm_mode = lpm_bitmap;
}

void SmdSat::set_tx_power(unsigned int power) {
	m_tx_power = power;
}

// ============================================================================
// Auto-write credentials from config store at boot
// ============================================================================


/**
 * @brief Whether the module holds what it needs to actually transmit.
 *
 * The SMD refuses to emit without a 16-byte secret key and a radio config, and
 * write_credentials_from_config() applies exactly those two checks before it
 * writes anything. Repeating them here lets the scheduler hold the TX instead
 * of scheduling one that dies inside send() -- by which point retrieve() has
 * already spent the position's burst credit and lost it.
 */
bool SmdSat::can_transmit() const {
	if (!configuration_store) return false;
	const std::string seckey = configuration_store->read_param<std::string>(ParamID::ARGOS_SECKEY);
	const std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);
	return seckey.size() == 32 && radioconf.size() >= 2 && (radioconf.size() % 2) == 0;
}
bool SmdSat::write_credentials_from_config() {
	if (!configuration_store) return false;

	// Flash write operations need ~100ms for persistence.
	// Previous delay (SMDSAT_DELAY_CMD_MS*2 = 60ms) was insufficient.
	//
	// KNOWN LIMITATION (audit 2026-05 F5): no PMU::kick_watchdog() between the
	// per-cmd wait_cmd() calls. Total worst case here is ~7 SPI writes × ~150ms
	// = ~1.1 s blocking. The 15-min WDT budget swallows this comfortably, but
	// if a future SPI cmd grows internal retries (e.g. cascade backoff) the
	// margin shrinks. Add a kick mid-routine if you ever extend this sequence
	// past ~5 s of blocking work. NOT a current bug — flagged for awareness.
	auto wait_cmd = []() { nrf_delay_ms(120); };

	unsigned int dec_id = configuration_store->read_param<unsigned int>(ParamID::ARGOS_DECID);
	unsigned int address = configuration_store->read_param<unsigned int>(ParamID::ARGOS_HEXID);
	std::string seckey = configuration_store->read_param<std::string>(ParamID::ARGOS_SECKEY);
	std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);

	// Skip if credentials are not configured yet
	if (seckey.empty() || radioconf.empty()) {
		DEBUG_WARN("SmdSat::%s: credentials not configured (seckey=%u rconf=%u) | skipping", __func__,
		           static_cast<unsigned>(seckey.size()), static_cast<unsigned>(radioconf.size()));
		return true;  // Not an error, just nothing to write
	}

	// Validate credential sizes before writing (seckey = 16 bytes = 32 hex chars)
	if (seckey.size() != 32) {
		DEBUG_ERROR("SmdSat::%s: invalid seckey length %u (expected 32 hex chars)", __func__,
		            static_cast<unsigned>(seckey.size()));
		return false;
	}
	if (radioconf.size() < 2 || (radioconf.size() % 2) != 0) {
		DEBUG_ERROR("SmdSat::%s: invalid radioconf length %u (must be even hex string)", __func__,
		            static_cast<unsigned>(radioconf.size()));
		return false;
	}

	DEBUG_INFO("SmdSat::%s: writing credentials from config store (id=%u addr=0x%08X)", __func__, dec_id, address);

	// Set ID
	try {
		m_cmd.set_id(dec_id);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to set ID", __func__);
		return false;
	}
	wait_cmd();

	// Set Address
	{
		uint8_t address_data[4] = { static_cast<uint8_t>((address >> 24) & 0xFF),
		                            static_cast<uint8_t>((address >> 16) & 0xFF),
		                            static_cast<uint8_t>((address >> 8) & 0xFF), static_cast<uint8_t>(address & 0xFF) };
		smd_uint8_array_t address_val = { SMDSAT_CMD_WRITE_ADDR_LEN - 1, address_data };
		try {
			m_cmd.set_address(&address_val);
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to set address", __func__);
			return false;
		}
	}
	wait_cmd();

	// Set Security Key
	{
		std::string seckey_bin = Binascii::unhexlify(seckey);
		smd_uint8_array_t seckey_struct = { static_cast<uint16_t>(seckey_bin.size()),
		                                    reinterpret_cast<uint8_t *>(seckey_bin.data()) };
		try {
			m_cmd.set_seckey(&seckey_struct);
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to set seckey", __func__);
			return false;
		}
	}
	wait_cmd();

	// Set Radio Configuration.
	// When adaptive modulation is ON, per-modulation RCONFs are managed by
	// ensure_modulation()/switch_modulation(). However, the master RCONF must
	// still be written on first boot or when credentials are dirty (chiperase,
	// PARMW on ARGOS_RADIOCONF, SATVF with force) — otherwise the STM32 flash
	// may contain invalid RCONF data and KMAC init will fail with MAC_ERROR.
	// After the first successful write, ensure_modulation() takes over.
	if (!radioconf.empty()) {
		bool adaptive = false;
		if (configuration_store) {
			adaptive = configuration_store->read_param<bool>(ParamID::ARGOS_ADAPTIVE_MODULATION);
		}
		if (!adaptive || configuration_store->is_credentials_dirty()) {
			if (adaptive) {
				DEBUG_INFO("SmdSat::%s: adaptive ON but credentials dirty — writing master RCONF as baseline",
				           __func__);
			}
			std::string rconf_bin = Binascii::unhexlify(radioconf);
			smd_uint8_array_t rconf_struct = { static_cast<uint16_t>(rconf_bin.size()),
			                                   reinterpret_cast<uint8_t *>(rconf_bin.data()) };
			try {
				m_cmd.set_radio_conf(&rconf_struct);
			} catch (...) {
				DEBUG_ERROR("SmdSat::%s: failed to set radio conf", __func__);
				return false;
			}
			wait_cmd();

