arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
			try {
				if (!m_cmd.save_radio_conf()) {
					DEBUG_ERROR("SmdSat::%s: failed to save RCONF", __func__);
					return false;
				}
			} catch (...) {
				DEBUG_ERROR("SmdSat::%s: save_radio_conf exception", __func__);
				return false;
			}
			wait_cmd();
		} else {
			DEBUG_INFO("SmdSat::%s: adaptive modulation ON — skipping master RCONF write", __func__);
		}
	}

	// If adaptive modulation is active and we just wrote the master RCONF as baseline,
	// re-apply the RCONF for the current modulation so the next TX uses the right config.
	{
		bool is_adaptive = false;
		if (configuration_store)
			is_adaptive = configuration_store->read_param<bool>(ParamID::ARGOS_ADAPTIVE_MODULATION);
		if (is_adaptive && m_modulation != ARGOS_MOD_LDA2) {
			std::string active_rconf;
			ArgosConfig ac;
			configuration_store->get_argos_configuration(ac);
			KineisModulation km = smd_to_kineis_mod(m_modulation);
			if (km == KineisModulation::VLDA4)
				active_rconf = ac.radioconf_vlda4;
			else if (km == KineisModulation::LDK)
				active_rconf = ac.radioconf_ldk;

			if (!active_rconf.empty() && active_rconf.size() == 32) {
				DEBUG_INFO("SmdSat::%s: restoring RCONF for active modulation %d", __func__,
				           static_cast<int>(m_modulation));
				std::string rconf_bin = Binascii::unhexlify(active_rconf);
				smd_uint8_array_t rconf_struct = { static_cast<uint16_t>(rconf_bin.size()),
				                                   reinterpret_cast<uint8_t *>(rconf_bin.data()) };
				try {
					m_cmd.set_radio_conf(&rconf_struct);
					wait_cmd();
					m_cmd.save_radio_conf();
					wait_cmd();
					m_cmd.load_kmac_profil(1);
					wait_cmd();
				} catch (...) {
					DEBUG_WARN("SmdSat::%s: failed to restore active RCONF", __func__);
				}
			}
		}
	}

	// Read back the actual modulation programmed in STM32WL flash and persist
	// it. The master RCONF (ARGOS_RADIOCONF) is encrypted hex — we can't decode
	// which modulation it encodes locally. After the credentials-dirty path
	// just wrote it, READ_RCONF gives us the truth. Cache to config_store so
	// subsequent boots load the correct modulation at SmdSat construction
	// without needing a runtime SPI readback on the surface-burst critical
	// path. Failure here is non-fatal — m_modulation keeps its prior value.
	try {
		SmdArgosModulation reported = m_modulation;
		m_cmd.read_radio_conf(&reported);
		if (reported != m_modulation) {
			DEBUG_INFO("SmdSat::%s: cached modulation update %d -> %d (master RCONF readback)", __func__,
			           static_cast<int>(m_modulation), static_cast<int>(reported));
			m_modulation = reported;
		}
		if (configuration_store) {
			configuration_store->write_param(ParamID::ARGOS_CACHED_MODULATION, static_cast<unsigned int>(m_modulation));
		}
	} catch (...) {
		DEBUG_WARN("SmdSat::%s: read_radio_conf failed — cached modulation not refreshed", __func__);
	}

	DEBUG_INFO("SmdSat::%s: credentials written successfully", __func__);
	return true;
}

// ============================================================================
// Credentials (legacy API, kept for direct hardware access if needed)
// ============================================================================

void SmdSat::set_credentials(unsigned int dec_id, unsigned int address, const std::string &seckey,
                             const std::string &radioconf) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	bool was_stopped = (m_state == SmdSatState::stopped);

	auto wait_between_commands = []() -> bool {
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2);
		return true;
	};

	if (was_stopped) {
		power_on_blocking();
	}

	for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
		try {
			m_cmd.set_id(dec_id);
			break;
		} catch (...) {
			if (retry == SMDSAT_SPI_MAX_RETRIES - 1) {
				DEBUG_ERROR("SmdSat::%s: Failed to set ID", __func__);
				goto cleanup;
			}
			nrf_delay_ms(smdsat_spi_retry_delay_ms());
		}
	}

	if (!wait_between_commands()) goto cleanup;

	{
		uint8_t address_data[4] = { static_cast<uint8_t>((address >> 24) & 0xFF),
		                            static_cast<uint8_t>((address >> 16) & 0xFF),
		                            static_cast<uint8_t>((address >> 8) & 0xFF), static_cast<uint8_t>(address & 0xFF) };
		smd_uint8_array_t address_val = { SMDSAT_CMD_WRITE_ADDR_LEN - 1, address_data };

		for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
			try {
				m_cmd.set_address(&address_val);
				break;
			} catch (...) {
				if (retry == SMDSAT_SPI_MAX_RETRIES - 1) {
					DEBUG_ERROR("SmdSat::%s: Failed to set address", __func__);
					goto cleanup;
				}
				nrf_delay_ms(smdsat_spi_retry_delay_ms());
			}
		}
	}

	if (!wait_between_commands()) goto cleanup;

	{
		std::string seckey_val = Binascii::unhexlify(seckey);
		smd_uint8_array_t seckey_struct = { static_cast<uint16_t>(seckey_val.size()),
		                                    reinterpret_cast<uint8_t *>(seckey_val.data()) };

		for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
			try {
				m_cmd.set_seckey(&seckey_struct);
				break;
			} catch (...) {
				if (retry == SMDSAT_SPI_MAX_RETRIES - 1) {
					DEBUG_ERROR("SmdSat::%s: Failed to set seckey", __func__);
					goto cleanup;
				}
				nrf_delay_ms(smdsat_spi_retry_delay_ms());
			}
		}
	}

	if (!wait_between_commands()) goto cleanup;

	{
		std::string radioconf_val = Binascii::unhexlify(radioconf);
		smd_uint8_array_t radioconf_struct = { static_cast<uint16_t>(radioconf_val.size()),
		                                       reinterpret_cast<uint8_t *>(radioconf_val.data()) };

		for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
			try {
				m_cmd.set_radio_conf(&radioconf_struct);
				break;
			} catch (...) {
				if (retry == SMDSAT_SPI_MAX_RETRIES - 1) {
					DEBUG_ERROR("SmdSat::%s: Failed to set radio conf", __func__);
					goto cleanup;
				}
				nrf_delay_ms(smdsat_spi_retry_delay_ms());
			}
		}
	}

	wait_between_commands();

	for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
		try {
			if (m_cmd.save_radio_conf()) break;
			if (retry == SMDSAT_SPI_MAX_RETRIES - 1) goto cleanup;
		} catch (...) {
			if (retry == SMDSAT_SPI_MAX_RETRIES - 1) goto cleanup;
		}
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	}

	wait_between_commands();

	for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
		try {
			m_cmd.load_kmac_profil(1);
			break;
		} catch (...) {
			if (retry == SMDSAT_SPI_MAX_RETRIES - 1) goto cleanup;
			nrf_delay_ms(smdsat_spi_retry_delay_ms());
		}
	}

	wait_between_commands();

	{
		uint8_t rconf_raw[SMDSAT_CMD_READ_RCONF_RAW_LEN] = { 0 };
		uint16_t rconf_raw_len = 0;
		try {
			m_cmd.read_rconf_raw(rconf_raw, &rconf_raw_len);
			char hex[SMDSAT_CMD_READ_RCONF_RAW_LEN * 2 + 1] = { 0 };
			for (uint16_t i = 0; i < rconf_raw_len && i < SMDSAT_CMD_READ_RCONF_RAW_LEN; i++) {
				uint8_t hi = rconf_raw[i] >> 4;
				uint8_t lo = rconf_raw[i] & 0x0F;
				hex[i * 2] = hi < 10 ? ('0' + hi) : ('a' + hi - 10);
				hex[i * 2 + 1] = lo < 10 ? ('0' + lo) : ('a' + lo - 10);
			}
			DEBUG_INFO("SmdSat::%s: RCONF_RAW readback OK: %s", __func__, hex);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: Failed to read back raw radio config", __func__);
		}
	}

	DEBUG_INFO("SmdSat::%s: Credentials set successfully", __func__);

cleanup:
	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}
}

#ifdef BENCH_TEST
void SmdSat::bench_parallel_probe(unsigned int nb_parallel, unsigned int retx_nb, unsigned int retx_period_s,
                                  char *out, unsigned int out_len) {
	if (nb_parallel < 1) nb_parallel = 1;
	if (nb_parallel > 4) nb_parallel = 4;   // enough to answer the question, bounded airtime
	if (retx_nb < 1) retx_nb = 1;
	if (retx_nb > 127) retx_nb = 127;
	// The module's own default config documents the pairing:
	//   .retx_period_s  "@attention ensure retx_period_s = 60 * nb_parallel_msg"
	//   .nb_parrallel_msg  "User-Message FIFO size @attention do not exceed 4"
	// (argos-smd-at-kineis-firmware, Kineis/App/kns_app.c). Honour it by default
	// so the probe measures the queue, not a misconfiguration.
	if (retx_period_s < 60 * nb_parallel) retx_period_s = 60 * nb_parallel;

	// Start from a KNOWN state, always. Measured 2026-09-01: after two or three
	// probe runs the SMD stopped answering any SPI command at all (every
	// load_kmac_profil refused, endless "AA AA AA" reads) -- the wedge this board
	// is already known for. A probe that inherits a wedged link measures the wedge,
	// not the question, so power-cycle first and make each run independent.
	DEBUG_INFO("SmdSat::bench_parallel_probe: power-cycling the module for a clean run");
	try {
		power_off_immediate();
	} catch (...) {}
	nrf_delay_ms(1500);
	PMU::kick_watchdog();
	power_on_blocking();
	PMU::kick_watchdog();
	nrf_delay_ms(smdsat_delay_power_on_ms());
	const bool was_stopped = true;  // we own the power state now

	uint8_t spi_st = 0, mac_st = 0;
	unsigned int accepted = 0, refused = 0, threw = 0;
	uint64_t t_first = 0;

